2022_2/PW/docker-code-main/www/codeigniter4/app/Controllers/Admin/Client.php

SELECT *
FROM `clients`
---
    public function listClients(){
        $data = [
            'arrayClients' => $this -> ClientModel->findAll()
        ];

INSERT INTO `clients` (`name`, `email`, `phone`, `address`) VALUES ('tiago Bauer', 'tiago@ulbra', '55875976986', 'Rua 1')
---
    public function insertClientAction(){
        $data = [
            'name'=> $this -> request -> getVar('name'),
            'email'=> $this -> request -> getVar('email'),
            'phone'=> $this -> request -> getVar('phone'),
            'address'=> $this -> request -> getVar('address')
        ];
        $this -> ClientModel ->insert($data);