2022_2/PW/docker-code-main/www/codeigniter4/app/Controllers/Admin/Product.php

    public function listProducts(){
        $data = [
            'arrayProducts' => $this -> ProductModel->findAll()
        ];
---
SELECT *
FROM `products`