2022_2/PW/docker-code-main/www/codeigniter4/app/Controllers/Client.php

SELECT *
FROM `clients`
---
    public function listClients(){

        $data = [
            'arrayClients' => $this -> ClientModel->findAll()
        ];