2022_2/PW/docker-code-main/www/codeigniter4/app/Controllers/Product.php

SELECT *
FROM `products`
---
    public function listProducts(){

        $ProductModel = new ProductModel();
        $data = [
            'arrayProducts' => $ProductModel->findAll()
        ];